In [1]:
import pandas as pd
import numpy as np

In [4]:
df1=pd.read_csv('7-concat_data1.csv')
df2=pd.read_csv('7-concat_data2.csv')
df1

   Employee_ID    Name Department
0            1   Emp_1    Finance
1            2   Emp_2  Marketing
2            3   Emp_3         HR
3            4   Emp_4    Finance
4            5   Emp_5    Finance
5            6   Emp_6  Marketing
6            7   Emp_7         HR
7            8   Emp_8         HR
8            9   Emp_9    Finance
9           10  Emp_10         IT

In [12]:
df=pd.concat([df1,df2],ignore_index=True)#ignore indexleri göz ardı eder

In [14]:
#BURADA YAPTIGIMIZ CONCAT İŞLEMİ DAHA ÇOK BASİT İŞLERDE KULLANILIR DAHA KOMPLİKE OLAYLARDA MERGE KULLANMAMIZ LAZIM

In [15]:
df1=pd.read_csv('7-merge_data1.csv')
df2=pd.read_csv('7-merge_data2.csv')
#BURADA VERİLER FARKLI EMPLOYEE_ID GÖRE BİRLEŞTİRMEMİZ LAZIM

In [16]:
df1

   Employee_ID    Name Department
0            1   Emp_1         IT
1            2   Emp_2         HR
2            3   Emp_3         IT
3            4   Emp_4  Marketing
4            5   Emp_5  Marketing
5            6   Emp_6         IT
6            7   Emp_7         IT
7            8   Emp_8         IT
8            9   Emp_9  Marketing
9           10  Emp_10  Marketing

In [17]:
df2

   Employee_ID  Salary  Experience
0            5   55658           3
1            1  114478           5
2           12   48431          19
3           10   32747           7
4            6   89150           9
5           13   95725           7
6            9   65773           4
7           11   86886          18

In [22]:
#outer join
df_outer_merge=pd.merge(df1,df2,on='Employee_ID',how='outer')
df_outer_merge
#OUTER JOİN ID ÜZERİNDEN BULDUGU HER ŞEYİ GETİRİR BİLGİ OLMAYANLARA NaN KOYAR

    Employee_ID    Name Department    Salary  Experience
0             1   Emp_1         IT  114478.0         5.0
1             2   Emp_2         HR       NaN         NaN
2             3   Emp_3         IT       NaN         NaN
3             4   Emp_4  Marketing       NaN         NaN
4             5   Emp_5  Marketing   55658.0         3.0
5             6   Emp_6         IT   89150.0         9.0
6             7   Emp_7         IT       NaN         NaN
7             8   Emp_8         IT       NaN         NaN
8             9   Emp_9  Marketing   65773.0         4.0
9            10  Emp_10  Marketing   32747.0         7.0
10           11     NaN        NaN   86886.0        18.0
11           12     NaN        NaN   48431.0        19.0
12           13     NaN        NaN   95725.0         7.0

In [24]:
#LEFT JOIN
df_left=pd.merge(df1,df2,on='Employee_ID',how='left')
df_left
#LEFT JOİIN İSE SOLDAKİ TABLOYA GÖRE BİLGİ GETİRİR SAĞDAKİNİ GÖZ ARDI EDER

   Employee_ID    Name Department    Salary  Experience
0            1   Emp_1         IT  114478.0         5.0
1            2   Emp_2         HR       NaN         NaN
2            3   Emp_3         IT       NaN         NaN
3            4   Emp_4  Marketing       NaN         NaN
4            5   Emp_5  Marketing   55658.0         3.0
5            6   Emp_6         IT   89150.0         9.0
6            7   Emp_7         IT       NaN         NaN
7            8   Emp_8         IT       NaN         NaN
8            9   Emp_9  Marketing   65773.0         4.0
9           10  Emp_10  Marketing   32747.0         7.0

In [26]:
df_inner=pd.merge(df1,df2,on='Employee_ID',how='inner')
df_inner
#SADECE EŞLEŞENLERİ ALIR

   Employee_ID    Name Department  Salary  Experience
0            1   Emp_1         IT  114478           5
1            5   Emp_5  Marketing   55658           3
2            6   Emp_6         IT   89150           9
3            9   Emp_9  Marketing   65773           4
4           10  Emp_10  Marketing   32747           7

In [1]:
#APPYL

In [8]:
df_apply=pd.read_csv('8-apply_function_data.csv')

In [9]:
df_apply

    Employee_ID     Name Department  Salary  Experience  Performance_Score
0             1    Emp_1  Marketing   82251           6                  5
1             2    Emp_2      Sales   52662          24                  3
2             3    Emp_3    Finance   38392           5                  3
3             4    Emp_4      Sales   60535          20                  3
4             5    Emp_5      Sales  108603           2                  2
..          ...      ...        ...     ...         ...                ...
95           96   Emp_96    Finance   93734          19                  4
96           97   Emp_97      Sales  100467          22                  2
97           98   Emp_98         IT   82662          23                  3
98           99   Emp_99         IT   42688          22                  1
99          100  Emp_100         HR   55342          14                  3

[100 rows x 6 columns]

In [5]:
#HER SATIRA AYRI AYRI UYGULAMA
def salary_(salary):
    if salary<50000:
        return 'Low'
    elif 50000<=salary<80000:
        return 'Mid'
    else:
        return 'High'

In [10]:
df_apply['Salary_sit']=df_apply['Salary'].apply(salary_)

In [11]:
df_apply

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_sit
0,1,Emp_1,Marketing,82251,6,5,High
1,2,Emp_2,Sales,52662,24,3,Mid
2,3,Emp_3,Finance,38392,5,3,Low
3,4,Emp_4,Sales,60535,20,3,Mid
4,5,Emp_5,Sales,108603,2,2,High
...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High
96,97,Emp_97,Sales,100467,22,2,High
97,98,Emp_98,IT,82662,23,3,High
98,99,Emp_99,IT,42688,22,1,Low
99,100,Emp_100,HR,55342,14,3,Mid

In [18]:
def perf_score(row):
    if row['Experience']>10:
        return row['Performance_Score']+1
    else:
        return row['Performance_Score']

In [21]:
df_apply['New_score']=df_apply.apply(perf_score,axis=1)

In [22]:
df_apply

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_sit,New_score
0,1,Emp_1,Marketing,82251,6,5,High,5
1,2,Emp_2,Sales,52662,24,3,Mid,4
2,3,Emp_3,Finance,38392,5,3,Low,3
3,4,Emp_4,Sales,60535,20,3,Mid,4
4,5,Emp_5,Sales,108603,2,2,High,2
...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High,5
96,97,Emp_97,Sales,100467,22,2,High,3
97,98,Emp_98,IT,82662,23,3,High,4
98,99,Emp_99,IT,42688,22,1,Low,2
99,100,Emp_100,HR,55342,14,3,Mid,4

In [44]:
#DİYELİMKİ BAZI ŞEYLERİN DEĞERİNİ DEĞİŞTİRMEK İSTİYORUZ
df_apply['New_name']=df_apply['Name'].apply(lambda x: x.replace('_',''))

In [45]:
df_apply

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_sit,New_score,New_name
0,1,Emp_1,Marketing,82251,6,5,High,5,Emp1
1,2,Emp_2,Sales,52662,24,3,Mid,4,Emp2
2,3,Emp_3,Finance,38392,5,3,Low,3,Emp3
3,4,Emp_4,Sales,60535,20,3,Mid,4,Emp4
4,5,Emp_5,Sales,108603,2,2,High,2,Emp5
...,...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High,5,Emp96
96,97,Emp_97,Sales,100467,22,2,High,3,Emp97
97,98,Emp_98,IT,82662,23,3,High,4,Emp98
98,99,Emp_99,IT,42688,22,1,Low,2,Emp99
99,100,Emp_100,HR,55342,14,3,Mid,4,Emp100

In [56]:
df_apply

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_sit,New_score
0,1,Emp_1,Marketing,82251,6,5,High,5
1,2,Emp_2,Sales,52662,24,3,Mid,4
2,3,Emp_3,Finance,38392,5,3,Low,3
3,4,Emp_4,Sales,60535,20,3,Mid,4
4,5,Emp_5,Sales,108603,2,2,High,2
...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High,5
96,97,Emp_97,Sales,100467,22,2,High,3
97,98,Emp_98,IT,82662,23,3,High,4
98,99,Emp_99,IT,42688,22,1,Low,2
99,100,Emp_100,HR,55342,14,3,Mid,4

In [57]:
#DİYELİMKİ YENİ KOLONU İSTEDİGİMİZ İNDEXE EKLEMEK İSTİYORUZ
df_apply.columns.get_loc('Name')#1-kolonun indexini öğren
df_apply.insert(2,'New_name',df_apply['Name'].apply(lambda x: x.replace('_','')))#sonra insert metoduyla ekleme yap
#ilk parametre kaçıncı index,ikinci sütun ismi,üçüncü ise değerleri alır

In [58]:
df_apply

,Employee_ID,Name,New_name,Department,Salary,Experience,Performance_Score,Salary_sit,New_score
0,1,Emp_1,Emp1,Marketing,82251,6,5,High,5
1,2,Emp_2,Emp2,Sales,52662,24,3,Mid,4
2,3,Emp_3,Emp3,Finance,38392,5,3,Low,3
3,4,Emp_4,Emp4,Sales,60535,20,3,Mid,4
4,5,Emp_5,Emp5,Sales,108603,2,2,High,2
...,...,...,...,...,...,...,...,...,...
95,96,Emp_96,Emp96,Finance,93734,19,4,High,5
96,97,Emp_97,Emp97,Sales,100467,22,2,High,3
97,98,Emp_98,Emp98,IT,82662,23,3,High,4
98,99,Emp_99,Emp99,IT,42688,22,1,Low,2
99,100,Emp_100,Emp100,HR,55342,14,3,Mid,4

In [66]:
df_apply.columns=df_apply.columns.str.replace('_','',regex=False) #kolon ismi değiştirme

In [67]:
df_apply

,EmployeeID,Name,Newname,Department,Salary,Experience,PerformanceScore,Salarysit,Newscore
0,1,Emp_1,Emp1,Marketing,82251,6,5,High,5
1,2,Emp_2,Emp2,Sales,52662,24,3,Mid,4
2,3,Emp_3,Emp3,Finance,38392,5,3,Low,3
3,4,Emp_4,Emp4,Sales,60535,20,3,Mid,4
4,5,Emp_5,Emp5,Sales,108603,2,2,High,2
...,...,...,...,...,...,...,...,...,...
95,96,Emp_96,Emp96,Finance,93734,19,4,High,5
96,97,Emp_97,Emp97,Sales,100467,22,2,High,3
97,98,Emp_98,Emp98,IT,82662,23,3,High,4
98,99,Emp_99,Emp99,IT,42688,22,1,Low,2
99,100,Emp_100,Emp100,HR,55342,14,3,Mid,4